#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/kwiniaskaridge/dns/runs/run-vWmEuvNWyBPpdtDu

Waiting for the plan to start...

Terraform v0.14.7
Configuring remote state backend...
Initializing Terraform configuration...
module.zones["com"].aws_route53_zone.zone: Refreshing state... [id=Z0742835FJMWTJT8Y4PN]
module.zones["net"].aws_route53_zone.zone: Refreshing state... [id=Z07645121K7HEZLG1Q1P]
module.kms.aws_kms_key.kms-key: Refreshing state... [id=88d82cc6-0196-44b7-9266-fbba7d749c6f]
module.zones["org"].aws_route53_zone.zone: Refreshing state... [id=Z0764517JF8DCELO601M]
module.zones["net"].aws_route53_key_signing_key.zone: Refreshing state... [id=Z07645121K7HEZLG1Q1P,kwiniaskaridge.net]
module.zones["org"].aws_route53_key_signing_key.zone: Refreshing state... [id=Z0764517JF8DCELO601M,kwiniaskaridge.org]
module.zones["com"].aws_route53_key_signing_key.zone: Refreshing state... [id=Z0742835FJMWTJT8Y4PN,kwiniaskaridge.com]
module.zones["com"].aws_route53_hosted_zone_dnssec.zone: Refreshing state... [id=Z0742835FJMWTJT8Y4PN]
module.zones["org"].aws_route53_hosted_zone_dnssec.zone: Refreshing state... [id=Z0764517JF8DCELO601M]
module.zones["net"].aws_route53_hosted_zone_dnssec.zone: Refreshing state... [id=Z07645121K7HEZLG1Q1P]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.org-email.aws_route53_record.google-org-tld will be created
  + resource "aws_route53_record" "google-org-tld" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "google-email-kwiniaskaridge-dot-org"
      + records         = [
          + "1 ASPMX.L.GOOGLE.COM.",
          + "10 ALT3.ASPMX.L.GOOGLE.COM.",
          + "10 ALT4.ASPMX.L.GOOGLE.COM.",
          + "15 3zf5ztqnguwgxle3oj4hkoj3q733xs5io6ak5pcqzx5tx3y2llla.mx-verification.google.com.",
          + "5 ALT1.ASPMX.L.GOOGLE.COM.",
          + "5 ALT2.ASPMX.L.GOOGLE.COM.",
        ]
      + ttl             = 3600
      + type            = "MX"
      + zone_id         = "Z0764517JF8DCELO601M"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @randallmorey, Action: `pull_request`*